<a href="https://colab.research.google.com/github/adarsh-2002/demo-repo/blob/master/FDS_W10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

##Creating Dataframe objects

In [2]:
arr = np.random.randint(0, 10, (5, 3))

In [3]:
arr

array([[8, 0, 6],
       [6, 8, 3],
       [4, 1, 0],
       [0, 3, 9],
       [1, 4, 5]])

In [4]:
df = pd.DataFrame(arr)

In [5]:
df

   0  1  2
0  8  0  6
1  6  8  3
2  4  1  0
3  0  3  9
4  1  4  5

In [6]:
df.values

array([[8, 0, 6],
       [6, 8, 3],
       [4, 1, 0],
       [0, 3, 9],
       [1, 4, 5]])

In [7]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [9]:
df.index = ['R1', 'R2', 'R3', 'R4', 'R5']
df.columns = ['C1', 'C2', 'C3']

In [10]:
df

    C1  C2  C3
R1   8   0   6
R2   6   8   3
R3   4   1   0
R4   0   3   9
R5   1   4   5

In [11]:
df.loc['R3', 'C1']

4

In [12]:
df.iloc[2, 0]

4

In [13]:
df.iloc[2:4, 1:3]

    C2  C3
R3   1   0
R4   3   9

In [14]:
df.loc['R3':'R5', 'C1':'C2'] #returns subset as a dataframe object

    C1  C2
R3   4   1
R4   0   3
R5   1   4

In [15]:
df.iloc[0] #returns row as a Series object

C1    8
C2    0
C3    6
Name: R1, dtype: int64

**A dataframe can be interpreted as a collection of series**

In [16]:
df.iloc[:, 0] #returns column as Series object

R1    8
R2    6
R3    4
R4    0
R5    1
Name: C1, dtype: int64

In [17]:
df.shape

(5, 3)

In [18]:
df.T

    R1  R2  R3  R4  R5
C1   8   6   4   0   1
C2   0   8   1   3   4
C3   6   3   0   9   5

Task on creating dataframes

In [19]:
def create_df(nRows, nCols, maxRand = 10):
  arr = np.random.randint(0, maxRand, (nRows, nCols))
  df = pd.DataFrame(arr)
  df.index = ['R' + str(x) for x in np.arange(1, nRows+1)]
  df.columns = ['C' + str(x) for x in np.arange(1,nCols+1)]
  return df

In [20]:
create_df(5, 3)

    C1  C2  C3
R1   2   5   5
R2   4   8   2
R3   2   7   6
R4   6   5   2
R5   2   3   4

In [21]:
create_df(2, 5)

    C1  C2  C3  C4  C5
R1   2   5   8   8   0
R2   6   7   9   3   7

In [22]:
mass = pd.Series([0.33, 4.87, 5.97, 0.642, 1898, 568, 86.8, 102, 0.0146], 
                 index = ['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])
diameter = pd.Series([4879, 12104, 12756, 3475, 6792, 142984, 120536, 51118, 49528, 2370],
                     index = ['Mercury', 'Venus', 'Earth', 'Moon', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])

In [23]:
mass

Mercury       0.3300
Venus         4.8700
Earth         5.9700
Mars          0.6420
Jupiter    1898.0000
Saturn      568.0000
Uranus       86.8000
Neptune     102.0000
Pluto         0.0146
dtype: float64

In [24]:
diameter

Mercury      4879
Venus       12104
Earth       12756
Moon         3475
Mars         6792
Jupiter    142984
Saturn     120536
Uranus      51118
Neptune     49528
Pluto        2370
dtype: int64

In [25]:
df = pd.DataFrame({'Mass' : mass, 'Diameter' : diameter})

In [26]:
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [27]:
df['Diameter']

Earth       12756
Jupiter    142984
Mars         6792
Mercury      4879
Moon         3475
Neptune     49528
Pluto        2370
Saturn     120536
Uranus      51118
Venus       12104
Name: Diameter, dtype: int64

In [28]:
df['Mass']['Earth']

5.97

In [29]:
df['pop'] = 0

In [30]:
df

              Mass  Diameter  pop
Earth       5.9700     12756    0
Jupiter  1898.0000    142984    0
Mars        0.6420      6792    0
Mercury     0.3300      4879    0
Moon           NaN      3475    0
Neptune   102.0000     49528    0
Pluto       0.0146      2370    0
Saturn    568.0000    120536    0
Uranus     86.8000     51118    0
Venus       4.8700     12104    0

In [31]:
df['pop']['Earth'] = 8000000000

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [32]:
df

              Mass  Diameter         pop
Earth       5.9700     12756  8000000000
Jupiter  1898.0000    142984           0
Mars        0.6420      6792           0
Mercury     0.3300      4879           0
Moon           NaN      3475           0
Neptune   102.0000     49528           0
Pluto       0.0146      2370           0
Saturn    568.0000    120536           0
Uranus     86.8000     51118           0
Venus       4.8700     12104           0

In [33]:
df['Mass'] is df.Mass

True

In [34]:
df['pop'] is df.pop

False

In [37]:
df.drop('pop', axis=1, inplace=True)

In [39]:
np.mean(df['Mass'])

296.29184444444445

In [40]:
df.loc['Col_Mean'] = [np.mean(df['Mass']), np.mean(df['Diameter'])]

In [41]:
df

                 Mass  Diameter
Earth        5.970000   12756.0
Jupiter   1898.000000  142984.0
Mars         0.642000    6792.0
Mercury      0.330000    4879.0
Moon              NaN    3475.0
Neptune    102.000000   49528.0
Pluto        0.014600    2370.0
Saturn     568.000000  120536.0
Uranus      86.800000   51118.0
Venus        4.870000   12104.0
Col_Mean   296.291844   40654.2

In [47]:
df.drop('Col_Mean', inplace=True)

In [52]:
def create_mean_row(df):
  # df.loc['Col_Mean'] = [np.mean(df[col]) for col in df.columns]
  df.loc['Col_Mean'] = df.mean()
  return df

In [54]:
create_mean_row(df)

                 Mass  Diameter
Earth        5.970000   12756.0
Jupiter   1898.000000  142984.0
Mars         0.642000    6792.0
Mercury      0.330000    4879.0
Moon              NaN    3475.0
Neptune    102.000000   49528.0
Pluto        0.014600    2370.0
Saturn     568.000000  120536.0
Uranus      86.800000   51118.0
Venus        4.870000   12104.0
Col_Mean   296.291844   40654.2

In [55]:
df = create_df(5, 3)

In [57]:
df

    C1  C2  C3
R1   0   0   6
R2   9   4   0
R3   2   5   5
R4   9   6   8
R5   4   5   2

In [58]:
df.mean()

C1    4.8
C2    4.0
C3    4.2
dtype: float64